# coding=utf-8

'''
北京到上海机票 
上海到深圳机票 
广州到上海机票 
深圳到北京机票 
北京到杭州机票 
成都到北京机票 
厦门到上海机票
上海到重庆机票 
西安到北京机票 
武汉到上海机票
'''


tasks = [{'dep':'北京', 'arr':'上海'},\
{'dep':'上海', 'arr':'深圳'},\
{'dep':'广州', 'arr':'上海'},\
{'dep':'深圳', 'arr':'北京'},\
{'dep':'深圳', 'arr':'厦门'},\
{'dep':'北京', 'arr':'杭州'},\
{'dep':'成都', 'arr':'北京'},\
{'dep':'厦门', 'arr':'上海'},\
{'dep':'上海', 'arr':'重庆'},\
{'dep':'西安', 'arr':'北京'},\
{'dep':'武汉', 'arr':'上海'}]

codeMap = {'北京':'BJS', '上海':'SHA', '深圳':'SZX', '广州':'CAN', '厦门':'XMN', '杭州':'HGH', '重庆':'CKG', '成都':'CTU', '西安':'SIA', '武汉':'WUH'}

interval = 10*60